# Переборы эл. множества
'''
numbers = {1, 2, 3, 4, 9.2, 5, 6, 7}

# Оператор принадлежности с множествами = макс. скорость
if 2 in numbers:
    print("Есть 2")
else:
    print("Нет 2")

# Работает, только если эл. множества можно складывать
print(sum(numbers))
'''
# Индексирования в множествах нет.
# Операций + и * в множествах нет.


'''
numbers = {0, 5, 6, 7, 1, 2, 3}
# Распаковка множества
print(*numbers, sep='\n')

print("\n\n\n\n")

# Вывод множества с отсортировкой эл.
print(sorted(numbers), sep='\n')
'''

# Сравнение множеств

'''
Код для работы с множествами нужно писать так, 
чтобы результат его выполнения не зависел от 
расположения элементов и был одинаковым при 
любом порядке обхода, последовательного обращения 
ко всем элементам. 
'''

# ------

