# Step 15 Набор сообщений
# Ваша программа должна игнорировать значения не находящиеся в словаре
"""
d={'.':'1', ',':'11', '?':'111', '!':'1111', ':':'11111',
    'A':'2', 'B':'22', 'C':'222',
    'D':'3', 'E':'33', 'F':'333',
    'G':'4', 'H':'44', 'I':'444',
    'J':'5', 'K':'55', 'L':'555',
    'M':'6', 'N':'66', 'O':'666',
    'P':'7', 'Q':'77', 'R':'777', 'S': '7777',
    'T':'8', 'U':'88', 'V':'888',
    'W':'9', 'X':'99', 'Y':'999', 'Z': '9999',
    ' ':'0'
}

inp = input().upper()
encoded = ''
for el in inp:
    if d.get(el) != None:
        encoded += d.get(el)
print(encoded)
"""

# Step 16 Код Морзе
"""
# Ваша программа должна игнорировать любые символы, не перечисленные в таблице.
letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']

morse = dict(zip(letters, morse)) # Создание словаря Морзе

inp = input().upper()

encoded = ''
for el in inp:
    if morse.get(el) != None:
        encoded += morse.get(el)
        encoded += ' '
print(encoded)
"""

